Hola ZeroNet<br><br><br>

Imagine an internet without any censorship, with websites that’ll never be taken down, where freedom of speech will hold true meaning. Where the government won’t spy on you and social media giants won’t objectify you as a mindless consumer. Where you won’t be bombarded with advertisements (carefully modelled according to your needs). Tamas Kocsis of Budapest did and the result is ZeroNet.<br

Open, free and uncensorable websites, using Bitcoin cryptography and BitTorrent network<br><br>

Boo yah. Try taking this one down. B) Summing it up in three simple lines–<br><br>

Uncensored: It’s nowhere because it’s everywhere!<br><br>

ZeroNet is decentralised, peer to peer web hosting. It doesn’t follow the conventional client server model. With ZeroNet, you’re the server, and you’re the client. When you visit a website on ZeroNet, the web pages get loaded on to your system and you start hosting them as well. Quite similar to how torrent seeding works. The site remains live as long as it has at least one peer hosting it. And since there is no single server hosting it, it is impossible for anyone to take down. Imagine a scenario, where hundreds of people are dragged to court for downloading HTML and CSS files. Not happening. And did I mention? You can also use ZeroNet with Tor and go completely anonymous.<br><br>

No hosting costs: Sites are served by visitors.<br><br>

You heard that right. It’s people like you and me who keep ZeroNet alive. You can have your website for free on ZeroNet in just a few clicks and also have your database. Really? Let’s get back to this later, shall we?<br

Always accessible: No single point of failure.<br><br>

As long as there is even a single peer hosting a site, the site is accessible to anyone in the world. You can even view your visited sites offline. You don’t even need Jio data packs now. :P<br><br>

For a better and detailed explanation of what, why and how zeronet works, watch this presentation.<br><br>

Then let’s get to it. Head over to ZeroNet and download the ZeroBundle. It’s as easy as they mention. Extract the contents of the zip anywhere on your drive and run zeronet.cmd (if you’re on Windows, i.e.) Most of the links following this can only be viewed after installing ZeroNet And that’s all. You can now start browsing zeronet in your regular browser.<br><br>