[
    {
        "title": "ZeroNet",
        "desc": "Imagine an internet without any censorship, with websites that’ll never be taken down, where freedom of speech will hold true meaning. Where the government won’t spy on you and social media giants won’t objectify you as a mindless consumer."
    },
    {
        "title":"Why isn't the globe represented upside down?",
        "desc":"This is an upside down map. Looks weird doesn’t it? They are predominantly used in Australia and New Zealand. After years of being bullied by other nations for their position on the Earth as South and lowly, these countries came up with the perfect reply. Also in a way making people wonder why is north up and south down?Ptolemy made a world map in 2 AD is said to have established the north-up convention of cartography. Though earlier maps exist which show that south-up maps were being made even after that as is evident with this map.It is also believed that some civilisations, including Arabic and Indian, made east-up maps owing to the fact that the sun rises in this direction. Even the word ‘north’ means ‘to east’, meaning it is to the east of the direction in which the sun rises.Early civilisations were evidently greatly influenced by this celestial body but the north-up convention stuck probably owning to the greater population in this region and little awareness about southern landmasses. The Greek actually thought they were the centre of the world.All regional beliefs changed as early Europeans explorers searched far and wide across the then understanding of the geography of Earth. What followed was globalisation. The north up convention struck along the ages due to the imperialism of Europeans who still remain at the centre of conventional and widely popular world maps.Another mind shattering effect of this psychology also deals with celestial bodies.The revolution of our planet around the Sun is defined as counter-clockwise when viewing from the top of the star. The immediate question that should come to your mind is where do you locate the top of a sphere?This image will exactly tell you how.Going by this logical positioning convention, if we were to stand on the southern tip of the sun we would observe that the earth revolves in the clockwise direction. Our observation of the whole universe right now could be exactly opposite only if north was down and south was up.Sundials could possibly be the origin of this clockwise/counter-clockwise discussion. In the northern hemisphere, all the sundials have the shadows moving in a clockwise direction. Quite obvious, isn’t it? But have you wondered how a sundial would work in the southern hemisphere? If you have been following my thoughts till now you may have probably guessed right. It moves counter-clockwise in Australia, Africa and South America. This has also led to the debate of usage of analogue watches which move in the clockwise direction.The point that I want to emphasize here is what I like to call ‘Dominance of Polarity’. Not only the north-south or the up-down debate. Any decision to define polarities in history have come with a price of dominating one value over another.The north-south debate wouldn’t have even made sense if we didn’t relate north to up and south as down. Up signifies better and positivity while down signifies more of negativity. This explains certain bias people in the northern hemisphere have towards their southern counterparts.This is an article not about our past, the history, but about the decisions that our predecessors made which we have to live in the present with. It is also a reminder to the present on how our decisions can affect the future to come."
    }
]